/**
 * 计算朝向四元数
 * X轴正向指向运动方向；Y轴在水平面内垂直于X轴，正向指向右侧；Z轴通过右手法则确定
 * @param {Cartesian3} position 位置
 * @param {Cartesian3} velocity 速度向量
 * @param {*} rotateX 绕X轴旋转的角度（roll）
 * @param {*} rotateY 绕Y轴旋转的角度（pitch）
 * @param {*} rotateZ 绕Z轴旋转的角度（heading）
 * @returns
 */
function _0x6ddb5e(params) {
  let _0x79ce = params['\u0068\u0064\u0067'],
    _0x95fef = params['\u0070\u0069\u0074\u0063\u0068'],
    _0xc0a4g = params['\u0072\u006F\u006C\u006C']
  let _0x23caf = new window[
    '\u004D\u0053\u0049\u004D\u0045\u0061\u0072\u0074\u0068'
  ]['\u0043\u0061\u0072\u0074\u0065\u0073\u0069\u0061\u006E\u0033'][
    '\u0066\u0072\u006F\u006D\u0044\u0065\u0067\u0072\u0065\u0065\u0073'
  ](
    params['\u006C\u006F\u006E'],
    params['\u006C\u0061\u0074'],
    params['\u0061\u006C\u0074']
  )
  var _0x17bg = (596430 ^ 596428) + (936570 ^ 936563)
  let _0x90dfe = new window[
    '\u004D\u0053\u0049\u004D\u0045\u0061\u0072\u0074\u0068'
  ][
    '\u0048\u0065\u0061\u0064\u0069\u006E\u0067\u0050\u0069\u0074\u0063\u0068\u0052\u006F\u006C\u006C'
  ](
    window['\u004D\u0053\u0049\u004D\u0045\u0061\u0072\u0074\u0068'][
      '\u004D\u0061\u0074\u0068'
    ]['\u0074\u006F\u0052\u0061\u0064\u0069\u0061\u006E\u0073'](
      _0x79ce - (147649 ^ 147611)
    ),
    window['\u004D\u0053\u0049\u004D\u0045\u0061\u0072\u0074\u0068'][
      '\u004D\u0061\u0074\u0068'
    ]['\u0074\u006F\u0052\u0061\u0064\u0069\u0061\u006E\u0073'](_0x95fef),
    window['\u004D\u0053\u0049\u004D\u0045\u0061\u0072\u0074\u0068'][
      '\u004D\u0061\u0074\u0068'
    ]['\u0074\u006F\u0052\u0061\u0064\u0069\u0061\u006E\u0073'](_0xc0a4g)
  )
  _0x17bg = (783878 ^ 783873) + (101263 ^ 101256)
  var _0xa773bf = (837272 ^ 837272) + (138338 ^ 138346)
  let _0x557d = window[
    '\u004D\u0053\u0049\u004D\u0045\u0061\u0072\u0074\u0068'
  ]['\u0054\u0072\u0061\u006E\u0073\u0066\u006F\u0072\u006D\u0073'][
    '\u0068\u0065\u0061\u0064\u0069\u006E\u0067\u0050\u0069\u0074\u0063\u0068\u0052\u006F\u006C\u006C\u0051\u0075\u0061\u0074\u0065\u0072\u006E\u0069\u006F\u006E'
  ](_0x23caf, _0x90dfe)
  _0xa773bf = (396951 ^ 396959) + (161622 ^ 161619)
  return _0x557d
}
export { _0x6ddb5e as getQuaternion }
